GitConverter/src/DataProcessors/НастройкиСистемыЗаявок/НастройкиСистемыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>НастройкиСистемыЗаявок</name>
  <comment>Обработка для настройки системы жалоб, пожеланий и запросов</comment>
</mdclass:DataProcessor>

GitConverter/src/InformationRegisters/НастройкиЗаявок/НастройкиЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиЗаявок</name>
  <comment>Регистр для хранения настроек системы заявок</comment>
  <informationRegisterPeriodicity>Nonperiodical</informationRegisterPeriodicity>
  <dimensions>
    <name>НастройкаПараметр</name>
    <comment>Параметр настройки (тип настройки)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <resources>
    <name>ЗначениеСтрока</name>
    <comment>Строковое значение настройки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеБулево</name>
    <comment>Булево значение настройки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеСписок</name>
    <comment>Список пользователей или других значений в формате XML</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
</mdclass:InformationRegister>

GitConverter/src/DataProcessors/НастройкиСистемыЗаявок/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Загружаем настройки из регистра
	ЗагрузитьНастройки();
	
	// Инициализируем таблицу типов запросов
	ИнициализироватьТаблицуТиповЗапросов();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройки()
	
	// Загружаем пользователей для запросов
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиЗаявок.ЗначениеСписок
	|ИЗ
	|	РегистрСведений.НастройкиЗаявок КАК НастройкиЗаявок
	|ГДЕ
	|	НастройкиЗаявок.НастройкаПараметр = &Параметр";
	
	Запрос.УстановитьПараметр("Параметр", "ПользователиДляЗапросов");
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ЗначениеСписок) Тогда
			ПользователиДляЗапросов.ЗагрузитьЗначения(ОбщегоНазначения.ЗначениеИзСтрокиXML(Выборка.ЗначениеСписок));
		КонецЕсли;
	КонецЕсли;
	
	// Загружаем получателей запросов
	Запрос.УстановитьПараметр("Параметр", "ПолучателиЗапросов");
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ЗначениеСписок) Тогда
			ПолучателиЗапросов.ЗагрузитьЗначения(ОбщегоНазначения.ЗначениеИзСтрокиXML(Выборка.ЗначениеСписок));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьТаблицуТиповЗапросов()
	
	// Создаем колонки таблицы типов запросов
	ТипыЗапросов.Колонки.Добавить("ТипЗаявки", Новый ОписаниеТипов("СправочникСсылка.ТипыЗаявок"), "Тип заявки");
	ТипыЗапросов.Колонки.Добавить("ТребуетПериод", Новый ОписаниеТипов("Булево"), "Требует период");
	
	// Загружаем существующие типы заявок
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТипыЗаявок.Ссылка КАК ТипЗаявки,
	|	ТипыЗаявок.ТребуетПериод КАК ТребуетПериод
	|ИЗ
	|	Справочник.ТипыЗаявок КАК ТипыЗаявок
	|ГДЕ
	|	НЕ ТипыЗаявок.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипыЗаявок.Наименование";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТипыЗапросов.Добавить();
		НоваяСтрока.ТипЗаявки = Выборка.ТипЗаявки;
		НоваяСтрока.ТребуетПериод = Выборка.ТребуетПериод;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПользователиДляЗапросовПриИзменении(Элемент)
	// Обработчик изменения списка пользователей для запросов
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиЗапросовПриИзменении(Элемент)
	// Обработчик изменения списка получателей запросов
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	Если СохранитьНастройкиНаСервере() Тогда
		ПоказатьПредупреждение(, "Настройки успешно сохранены!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СохранитьНастройкиНаСервере()
	
	Попытка
		
		НачатьТранзакцию();
		
		// Очищаем старые настройки
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиЗаявок.НастройкаПараметр КАК НастройкаПараметр
		|ИЗ
		|	РегистрСведений.НастройкиЗаявок КАК НастройкиЗаявок
		|ГДЕ
		|	НастройкиЗаявок.НастройкаПараметр В (&СписокПараметров)";
		
		СписокПараметров = Новый Массив;
		СписокПараметров.Добавить("ПользователиДляЗапросов");
		СписокПараметров.Добавить("ПолучателиЗапросов");
		
		Запрос.УстановитьПараметр("СписокПараметров", СписокПараметров);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НаборЗаписей = РегистрыСведений.НастройкиЗаявок.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.НастройкаПараметр.Установить(Выборка.НастройкаПараметр);
			НаборЗаписей.Записать();
		КонецЦикла;
		
		// Сохраняем пользователей для запросов
		Если ПользователиДляЗапросов.Количество() > 0 Тогда
			НаборЗаписей = РегистрыСведений.НастройкиЗаявок.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.НастройкаПараметр.Установить("ПользователиДляЗапросов");
			
			Запись = НаборЗаписей.Добавить();
			Запись.НастройкаПараметр = "ПользователиДляЗапросов";
			Запись.ЗначениеСписок = ОбщегоНазначения.ЗначениеВСтрокуXML(ПользователиДляЗапросов.ВыгрузитьЗначения());
			
			НаборЗаписей.Записать();
		КонецЕсли;
		
		// Сохраняем получателей запросов
		Если ПолучателиЗапросов.Количество() > 0 Тогда
			НаборЗаписей = РегистрыСведений.НастройкиЗаявок.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.НастройкаПараметр.Установить("ПолучателиЗапросов");
			
			Запись = НаборЗаписей.Добавить();
			Запись.НастройкаПараметр = "ПолучателиЗапросов";
			Запись.ЗначениеСписок = ОбщегоНазначения.ЗначениеВСтрокуXML(ПолучателиЗапросов.ВыгрузитьЗначения());
			
			НаборЗаписей.Записать();
		КонецЕсли;
		
		// Сохраняем настройки типов запросов
		Для Каждого СтрокаТипа Из ТипыЗапросов Цикл
			Если ЗначениеЗаполнено(СтрокаТипа.ТипЗаявки) Тогда
				ОбъектТипа = СтрокаТипа.ТипЗаявки.ПолучитьОбъект();
				ОбъектТипа.ТребуетПериод = СтрокаТипа.ТребуетПериод;
				ОбъектТипа.Записать();
			КонецЕсли;
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
		Возврат Истина;
		
	Исключение
		ОтменитьТранзакцию();
		ПоказатьПредупреждение(, "Ошибка при сохранении настроек: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции
